---
type: ConduitSize
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 9
tags: [revit-api, class]
---

# ConduitSize

`Autodesk.Revit.DB.Electrical.ConduitSize` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ConduitSize | 2017 | `public ConduitSize ( double nominalDiameter , double innerDiameter , double outerDiameter , double bendRadius , bool usedInSizeLists , bool usedInSizing )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | BendRadius | 2017 | `public double BendRadius { get ; }` |
| Property | InnerDiameter | 2017 | `public double InnerDiameter { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | NominalDiameter | 2017 | `public double NominalDiameter { get ; }` |
| Property | OuterDiameter | 2017 | `public double OuterDiameter { get ; }` |
| Property | UsedInSizeLists | 2017 | `public bool UsedInSizeLists { get ; }` |
| Property | UsedInSizing | 2017 | `public bool UsedInSizing { get ; }` |